<template>
        <header class="main-header container-fluid">
            <div>
                 <router-link class="logo" to="/">
                    <img src="@/assets/logo-small.png" alt="Логотип ООО АНТЕЙ" title="Главная страница. Вы здесь." />
                </router-link>
                <a href="tel:8 (86132) 3-40-04" class="tel white-text-shadow">8&nbsp;(86132)&nbsp;3-40-04</a>
            </div>
            <nav class="menu">

                <svg id="big-menu" width="373" height="167" viewBox="0 0 373 167" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <router-link to="/service/video" title="Ссылка на страницу Видеонаблюдения">
                        <path class="svg-fill-red" d="M66.4 111C68 111 68.5 108.8 67 108L26.3 93C25.5 92.8 24.6 93.2 24.3 94L21.6 101.4C21.5 101.9 21.6 102.4 21.85 102.8L26.8 109.5C27 109.7 27.2 109.9 27.5 110L36.6 113.3C36.5 113.7 36.4 114 36.4 114.5C36.4 115.3 36.7 116 37.3 116.6L34.8 123.2L34.7 123.2C33.4 123.2 32.3 124 31.9 125.2H15.7V123.9C15.7 123.2 15.1 122.6 14.4 122.6C14.1 122.6 13.8 122.7 13.6 122.9V121.6C13.6 120.9 13 120.3 12.3 120.3C11.6 120.3 11 120.9 11 121.6V131.4C11 132.2 11.6 132.7 12.3 132.7C13 132.7 13.6 132.2 13.6 131.4V130.2C13.8 130.3 14.1 130.4 14.4 130.4C15.1 130.4 15.7 129.8 15.7 129.1V127.6H32.1C32.6 128.5 33.6 129.1 34.7 129.1C36.4 129.1 37.7 127.8 37.7 126.1C37.7 125.3 37.3 124.5 36.8 124L39.3 117.4C39.3 117.5 39.4 117.5 39.4 117.5C40.7 117.5 41.8 116.6 42.2 115.4L50.7 118.5C51.1 118.7 51.5 118.7 51.9 118.5L60.4 114.7C60.8 114.6 61.1 114.2 61.2 113.8L61.7 112.2C61.9 111.5 62.5 111.1 63.2 111.1H66.4ZM66.7 111.7H62.7L61.8 115.1L52.5 119.3L62.6 123.2L63.9 119.5L65.3 120.2L67.6 114.1L66.1 113.6L66.7 111.8ZM68.8 113.4L71 114.2L68.2 122.4L65.8 121.5L68.8 113.4ZM59.6 112.6C60 112.6 60.2 112.3 60.2 111.8C60.2 111.4 60 111 59.6 111C59.2 111 58.9 111.4 58.9 111.8C58.9 112.3 59.2 112.6 59.6 112.6Z"/>
                        <path id="camera" class="svg-fill-gray" d="M5 94.8L41 74L77 94.8V136.3L41 157L5 136.3V94.8Z"/>
                    </router-link>
                    <router-link to="/service/barrier" title="Ссылка на страницу систем доступа">
                        <path class="svg-fill-red" d="M193.8 133.3V115.3L237 102.1L235.7 98L193.8 110.8V108.6H177V133.3H193.8ZM187.9 116.4C187.9 118 186.6 119.3 185 119.3C183.4 119.3 182 118 182 116.4C182 114.8 183.4 113.5 185 113.5C186.6 113.5 187.9 114.8 187.9 116.4ZM200.9 109.1L202.9 108.5L201.8 112.6L199.6 113.2L200.9 109.1ZM214 105L212 105.7L210.8 109.8L212.9 109.1L214 105ZM221.7 102.7L223.7 102L222.6 106L220.4 106.7L221.7 102.7ZM233.6 99L231.6 99.6L230.3 103.7L232.5 103L233.6 99Z"/>
                        <path id="barrier" class="svg-fill-gray" d="M171 94.8L207 74L243 94.8V136.3L207 157L171 136.3V94.8Z"/>
                    </router-link>
                    <router-link to="/service/home" title="Ссылка на страницу Умный Дом">
                        <path class="svg-fill-red" d="M55.6 24.8C55.6 22.7 57.3 21 59.4 21C61.5 21 63.2 22.7 63.2 24.8V30.5C63.2 30.6 63.2 30.7 63.2 30.7L113 42.1V53.2L63 31.7C63 31.8 63 31.9 62.9 32L112.6 60.7L102.6 66.4L62.5 32.8C62.5 32.8 62.4 32.9 62.4 32.9L96.9 69.8L87.6 75.4L61.6 33.7C61.5 33.8 61.3 33.8 61.2 33.9L80.8 77L69 69.7L60.2 34.3C60 34.3 60 34.3 59.9 34.3L63.4 66.8L53 60.7L58.6 34.3C56.9 33.9 55.6 32.4 55.6 30.5V24.8ZM59.4 31.9C60.2 31.9 60.8 31.3 60.8 30.5C60.8 29.8 60.2 29.2 59.4 29.2C58.7 29.2 58 29.8 58 30.6C58 31.3 58.7 31.9 59.4 31.9Z"/>
                        <path id="home" class="svg-fill-gray" d="M47 22.8L83 2L119 22.8V64.3L83 85L47 64.3V22.8Z"/>
                    </router-link>
                    <router-link to="/service/phone" title="Ссылка на страницу Телефонии">
                        <path class="svg-fill-red" d="M152.2 18.4L158.5 25.9C159.3 26.9 161 26.5 161.7 25.4C168 16.8 193 46.5 183.4 51.3C182.3 51.8 181.5 53.4 182.3 54.3L188.7 61.9C189 62.4 189.8 62.6 190.3 62.3C207 54.4 162.7 1.6 152 16.7C151.7 17.2 151.8 17.9 152.2 18.4ZM142 66.4H145.4V40.8H142V66.4ZM153.1 66.4V56.4H159.2C162 56.4 164.3 55.7 165.8 54.4C167.4 53 168.2 51.1 168.2 48.6C168.2 46.3 167.4 44.4 165.8 43C164.2 41.5 162 40.8 159.2 40.8H149.8V66.4H153.1ZM159.2 53.6H153.1V43.6H159.4C161 43.6 162.4 44.1 163.4 45C164.3 45.9 164.8 47.1 164.8 48.7C164.8 50.3 164.3 51.5 163.4 52.4C162.4 53.2 161 53.6 159.2 53.6Z"/>
                        <path id="phone" class="svg-fill-gray" d="M130 22.8L166 2L202 22.8V64.3L166 85L130 64.3V22.8Z"/>
                    </router-link>
                    <router-link to="/service/tv" title="Ссылка на страницу ТВ">
                        <path class="svg-fill-red" fill-rule="evenodd" d="M306.9 88L301.8 100.2C303.5 101.4 305.1 102.7 306.6 104.1L304.1 108.3L316.1 109.6L322.9 119.6L315.4 132L308.6 122L296.6 120.7L293.5 125.9C292.1 124.5 290.6 123.2 289 122.1L286.3 126.5C289 128.6 291.1 131.2 292.2 134C293.2 136.4 293.5 138.9 292.9 141C290 138.8 286 136 281.4 133.2L273.6 143.3C274 143.6 274.2 144.1 273.9 144.5C273.7 144.9 273 145 272.5 144.7C272 144.4 271.8 143.8 272 143.4C272.3 143 272.8 142.9 273.3 143.1L278.3 131.3C274 128.8 269.9 126.7 266.7 125.2C268.3 123.7 270.6 122.8 273.2 122.5C276.1 122.2 279.2 122.8 282.2 124.1L284.9 119.7C283.2 118.9 281.5 118.1 279.7 117.6L282.8 112.4L276 102.4L264 101.1L271.5 88.7L283.5 90L290.3 100L292.8 95.8C294.7 96.4 296.6 97.2 298.4 98.2L306.9 88ZM281.9 91.2L271.4 90.2L270.1 92.3L280.6 93.4L281.9 91.2ZM289 100.7L283.2 91.9L281.9 94.1L287.7 102.9L289 100.7ZM279.7 94.9L269.2 93.9L267.9 96.1L278.4 97.1L279.7 94.9ZM286.8 104.5L280.9 95.7L279.6 97.8L285.5 106.6L286.8 104.5ZM277.5 98.6L267 97.6L265.7 99.8L276.1 100.8L277.5 98.6ZM284.5 108.2L278.7 99.4L277.4 101.6L283.2 110.4L284.5 108.2ZM304.1 109.8L314.5 110.8L313.2 113L302.8 111.9L304.1 109.8ZM315.8 111.5L321.6 120.3L320.3 122.5L314.5 113.7L315.8 111.5ZM301.8 113.5L312.3 114.5L311 116.7L300.5 115.7L301.8 113.5ZM313.6 115.3L319.4 124.1L318.1 126.2L312.3 117.4L313.6 115.3ZM299.6 117.2L310.1 118.2L308.8 120.4L298.3 119.4L299.6 117.2ZM311.3 119L317.1 127.8L315.8 130L310 121.2L311.3 119Z"/>
                        <path id="tv" class="svg-fill-gray" d="M254 94.8L290 74L326 94.8V136.3L290 157L254 136.3V94.8Z"/>
                    </router-link>
                    <router-link to="/service/split" title="Ссылка на страницу Сплит-систем">
                        <path class="svg-fill-red" fill-rule="evenodd" clip-rule="evenodd" d="M222 27C220.3 27 219 28.3 219 30V41.6C219 43.2 220.3 44.6 222 44.6H276C277.7 44.6 279 43.2 279 41.6V30C279 28.3 277.7 27 276 27H222ZM262.3 28.3C261.4 28.3 260.8 29 260.8 29.8V32.8C260.8 33.6 261.4 34.3 262.3 34.3H276.2C277 34.3 277.7 33.6 277.7 32.8V29.8C277.7 29 277 28.3 276.2 28.3H262.3Z"/>
                        <path class="svg-fill-gray-only" d="M276.9 34.9H221.3C220.5 34.9 219.8 35.6 219.8 36.4V42.1C219.8 42.9 220.5 43.6 221.3 43.6H276.9C277.7 43.6 278.4 42.9 278.4 42.1V36.4C278.4 35.6 277.7 34.9 276.9 34.9Z"/>
                        <path class="svg-fill-red" d="M220.3 36.9C220.4 36.1 221 35.5 221.8 35.5H276.3C277.1 35.5 277.8 36.1 277.9 36.9L278.1 39.6C278.1 40.4 277.4 41.2 276.6 41.2H221.6C220.7 41.2 220 40.4 220.1 39.6L220.3 36.9Z"/>
                        <path class="svg-fill-red" d="M274.7 50.4C275 50.5 275 50.9 274.8 51C272.2 52.8 268.6 54.3 264.3 55.4C259.6 56.6 254.3 57.2 248.8 57.2C243.4 57.1 238.1 56.5 233.4 55.3C229.1 54.2 225.6 52.7 223.1 50.9C222.8 50.7 222.9 50.3 223.2 50.3C223.3 50.3 223.4 50.3 223.5 50.3C225.9 52.3 229.5 53.8 234 55C238.4 56.1 243.6 56.7 248.8 56.7C254.1 56.7 259.3 56.2 263.8 55C268.2 53.9 271.9 52.4 274.4 50.5C274.5 50.4 274.6 50.4 274.7 50.4Z"/>
                        <path class="svg-fill-red"  d="M274.7 54.9C275 55 275 55.4 274.8 55.5C272.2 57.3 268.6 58.8 264.3 59.9C259.6 61.1 254.3 61.7 248.8 61.7C243.4 61.7 238.1 61 233.4 59.8C229.1 58.8 225.6 57.2 223.1 55.4C222.8 55.2 222.9 54.9 223.2 54.8C223.3 54.8 223.4 54.8 223.5 54.9C225.9 56.8 229.5 58.4 234 59.5C238.4 60.6 243.6 61.2 248.8 61.3C254.1 61.3 259.3 60.7 263.8 59.6C268.2 58.5 271.9 56.9 274.4 55C274.5 54.9 274.6 54.9 274.7 54.9Z"/>
                        <path class="svg-fill-red" d="M274.7 59.4C275 59.5 275 59.9 274.8 60C272.2 61.8 268.6 63.4 264.3 64.4C259.6 65.6 254.3 66.2 248.8 66.2C243.4 66.2 238.1 65.5 233.4 64.4C229.1 63.3 225.6 61.7 223.1 59.9C222.8 59.8 222.9 59.4 223.2 59.3C223.3 59.3 223.4 59.3 223.5 59.4C225.9 61.3 229.5 62.9 234 64C238.4 65.1 243.6 65.8 248.8 65.8C254.1 65.8 259.3 65.2 263.8 64.1C268.2 63 271.9 61.4 274.4 59.5C274.5 59.4 274.6 59.4 274.7 59.4Z"/>
                        <path id="fan" class="svg-fill-gray" d="M213 22.8L249 2L285 22.8V64.3L249 85L213 64.3V22.8Z"/>
                    </router-link>
                    <router-link to="/service/signaling" title="Ссылка на страницу Сигнализации">
                        <path class="svg-fill-red" d="M136.3 102.5C135.2 104.4 134.1 106.2 134.1 109.1C134.1 110.6 135.2 112.9 136.4 115.7C139.9 123.7 145.1 135.5 132.8 142.3C161.6 138.6 153.7 115.1 150.6 105.9C150.5 105.6 150.4 105.3 150.3 105.1C150.3 118.7 146.8 118.9 145.3 119C145 119 144.9 119 144.7 119.1C139.1 119.1 140.5 114.7 142.1 109.3C143.1 106.3 144.1 103 144 100C143.7 93.6 140.2 90.6 136.4 89C139.7 96.4 138 99.5 136.3 102.5ZM122.5 89.91L110.9 102.3V94.7H104.464V108.2L94 118.8H104.5V142.2H121.4C112.9 135.5 116.4 129.9 119.5 124.8C121.6 121.5 123.5 118.4 121.7 115.5C127.6 116.8 126.4 120.9 125.3 124.5C124.4 127.9 123.5 130.9 128.1 131.1C133.8 131.1 132.3 127.3 130.4 122.2C128 116 125 108 133.1 102.9V101L122.5 89.9Z"/>
                        <path id="fire" class="svg-fill-gray" d="M88 94.8L124 74L160 94.8V136.3L124 157L88 136.3V94.8Z"/>
                    </router-link>
                    <router-link to="/about" title="Ссылка на страницу Информации">
                        <path class="svg-fill-red" d="M325.3 52.5L323 51C324.5 48.8 324.5 48 326.8 42V42C327.5 39.8 327.5 39.8 327.5 37.5C327.5 35.3 328.3 32.3 330.5 30.8C333.5 30 335.8 28.5 335 35.3C332 59.3 333.5 66.8 336.5 67.5C338.8 67.5 343.3 64.5 349.3 49.5L351.5 51C350 55.5 341 74.3 334.3 73.5C328.3 72.8 325.3 66 326.8 49.5L325.3 52.5Z"/>
                        <path class="svg-fill-red" d="M333.5 24C336 24 338 22 338 19.5C338 17 336 15 333.5 15C331 15 329 17 329 19.5C329 22 331 24 333.5 24Z"/>
                        <path id="info" class="svg-fill-gray" d="M296 22.8L332 2L368 22.8V64.3L332 85L296 64.3V22.8Z"/>
                    </router-link>
                </svg>
                <input type="checkbox" id="menu-show" />
                <label id="small-menu" for="menu-show">
                    <svg width="58" height="66" viewBox="0 0 58 66" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <g id="top-line">
                    <rect x="7.25" y="39.5" width="43.25" height="2.5" rx="1.25" fill="url(#paint0_linear)"/>
                    </g>
                    <g id="middle-line">
                    <path d="M14 46.3C12.9 45.7 13.4 44 14.7 44H42.8C44.1 44 44.6 45.7 43.4 46.3C43.3 46.4 43 46.5 42.8 46.5H14.7C14.5 46.5 14.2 46.4 14 46.3Z" fill="url(#paint1_linear)"/>
                    </g>
                    <g id="bottom-line">
                    <path d="M22.2 50.8C21.1 50.2 21.6 48.5 22.8 48.5H35.4C36.6 48.5 37.1 50.1 36 50.8C35.9 50.9 35.6 51 35.4 51H22.8C22.6 51 22.4 50.9 22.2 50.84Z" fill="url(#paint2_linear)"/>
                    </g>
                    <g id="letter-m">
                    <path d="M18.5 36.5V12.5L29 25.9L39.3 12.5V36.5" stroke="url(#paint3_radial)" stroke-width="6" stroke-linecap="round" stroke-linejoin="round"/>
                    </g>
                    <g id="letter-x">
                    <path d="M39 43.8L16.4 15L29 31L41.3 15L19 43.8" stroke="url(#paint3_radial)" stroke-width="6" stroke-linecap="round" stroke-linejoin="round"/>
                    </g>
                    <g>
                    <path id="polygon-small" d="M5 15L29 1.21L53 15V42.7L29 56.5L5 42.7V15Z" stroke="#504A40" stroke-width="1"/>
                    </g>
                    <defs>
                    <linearGradient id="paint0_linear" x1="29" y1="42" x2="29" y2="38" gradientUnits="userSpaceOnUse">
                    <stop stop-color="#625D52"/>
                    <stop offset="1" stop-color="#E5E5E5"/>
                    </linearGradient>
                    <linearGradient id="paint1_linear" x1="28.75" y1="42.75" x2="28.75" y2="46.5" gradientUnits="userSpaceOnUse">
                    <stop stop-color="#C4C4C4"/>
                    <stop offset="1" stop-color="#504A40"/>
                    </linearGradient>
                    <linearGradient id="paint2_linear" x1="29" y1="47.5" x2="29" y2="51" gradientUnits="userSpaceOnUse">
                    <stop stop-color="#C4C4C4"/>
                    <stop offset="1" stop-color="#504A40"/>
                    </linearGradient>
                    <radialGradient id="paint3_radial" cx="0" cy="0" r="1" gradientUnits="userSpaceOnUse" gradientTransform="translate(29 7.75) rotate(90) scale(35 71.2365)">
                    <stop stop-color="#E66A6A"/>
                    <stop offset="0.237428" stop-color="#BA2525"/>
                    <stop offset="0.780248" stop-color="#BA2525"/>
                    <stop offset="1" stop-color="#423D33"/>
                    </radialGradient>
                    </defs>
                    </svg>
                </label>
                <div class="menu-to-show">
                    <router-link to="/service/video"><img src="imgs/video-watch.svg" /></router-link>
                    <router-link to="/service/signaling"><img src="imgs/signalization.svg" /></router-link>
                    <router-link to="/service/tv"><img src="imgs/tv-system.svg" /></router-link>
                    <router-link to="/service/phone"><img src="imgs/phone-system.svg" /></router-link>
                    <router-link to="/service/home"><img src="imgs/clever-home.svg" /></router-link>
                    <router-link to="/service/barrier"><img src="imgs/barrier-system.svg" /></router-link>
                    <router-link to="/service/split"><img src="imgs/conditioner.svg" /></router-link>
                    <router-link to="/about"><img src="imgs/information.svg" /></router-link>
                </div>
            </nav>
        </header>
</template>

<script>
export default {
  name: 'HeaderSite'
}
</script>
